Revit 2024 API
AnalysisDisplayLegendSettings Constructor
 Constructs a default instance of legend settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayLegendSettings()
Visual Basic
Public Sub New
Visual C++
public:
AnalysisDisplayLegendSettings()
See Also
AnalysisDisplayLegendSettings Class
AnalysisDisplayLegendSettings Overload
Autodesk.Revit.DB.Analysis Namespace